clear all; clc; close all;

n = 100;
reps = 10000;
rec=zeros(1,reps); % Δημιουργία ενός μηδενικού πίνακα 
people=1;
for q = 1:n
for i = 1:reps
    
    days = randi([1 365],1,people); % Δημιουργία τυχαίων ημερομηνιών ανάλογα με τα άτομα που υπάρχουν 
    rec(1,i)=length(unique(days)); % Επιστροφή του μήκους του πίνακα 
end
a1 = rec<people; % Αν ο πίνακας rec είναι μικρότερος από τους ανθρώπους αυτό σημαίνει ότι υπάρχουν άνθρωποι με κοινές
                   % ημερομηνίες άρα να βγάλει λογικό 1 
frac(q,1)=(sum(a1)/i); % Προσθέτει όλους τους άσους και το διαίρει με τις επαναλήψεις για να βγει η πιθανότητα 

 people=people+1;
end

deviation= 0.507-frac(23,1); % Η διαφορά ανάμεσα στην πειραματική τιμή με την 
 if(deviation<0)                %θεωρητική στα 23 άτομα 
    deviation = deviation*-1
 else 
     deviation
end               

figure(1) % Διάγραμμα για τις πιθανότατες και με τα άτομα 
hold on
plot(1:n,frac,'b')
plot(23,0.507,'h') 
legend('Πειραματικη πιθανοτητα', 'Θεωρητικό σημείο στα 23 ατομα')
xlabel('’νθρωποι'), 
ylabel('Πιθανότητα γενεθλίων'),
title(('Πιθανότητα ύπαρξης ίδιας ημέρας γενεθλίων ')), 
grid on
